tap "cloudflare/cloudflare"
tap "cloudfoundry/tap"
tap "dart-lang/dart"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "int128/kubelogin"
tap "nikitabobko/tap"
# Password hashing library and CLI utility
brew "argon2"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Informative, fancy bash prompt for Git users
brew "bash-git-prompt"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# DuckDuckGo from the terminal
brew "ddgr"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Validating, recursive, caching DNS resolver
brew "unbound"
# OpenType text shaping engine
brew "harfbuzz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Multi-format archive and compression library
brew "libarchive"
# Next-gen compiler infrastructure
brew "llvm"
# Text-based web browser
brew "lynx"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Multi-Target Application (MTA) build tool for Cloud Applications
brew "mbt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool for managing OCI containers and pods
brew "podman"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Access X11 clipboards from the command-line
brew "xclip"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# Cloud Foundry CLI
brew "cloudfoundry/tap/cf-cli@8"
# SDK
brew "dart-lang/dart/dart", link: false
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
# View, create, manipulate, print and manage files in Portable Document Format
cask "adobe-acrobat-pro"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Professional graphic design software
cask "affinity-designer"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Audio video conferencing
cask "alfaview"
# Memory training application
cask "anki"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Download and manage your addons and mods
cask "curseforge"
# Universal database tool and SQL client
cask "dbeaver-community"
# Eclipse IDE for Java developers
cask "eclipse-java"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Desktop client for GitHub repositories
cask "github"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reference manager to edit, manage and search BibTeX files
cask "jabref"
# Software for Logitech devices
cask "logi-options-plus"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# OpenJDK distribution from SAP
cask "sapmachine-jdk"
# Per-app audio controls
cask "sound-control"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Compatibility layer to run Windows applications
cask "wine-crossover"
vscode "adpyke.codesnap"
vscode "alexcvzz.vscode-sqlite"
vscode "alexisvt.flutter-snippets"
vscode "anan.jetbrains-darcula-theme"
vscode "anandabibekray.intellij-idea-new-ui-theme"
vscode "andenetalexander.vim-cheatsheet"
vscode "calebfiggers.typst-companion"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "humao.rest-client"
vscode "infeng.vscode-react-typescript"
vscode "james-yu.latex-workshop"
vscode "mathematic.vscode-latex"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "nvarner.typst-lsp"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "sapos.yeoman-ui"
vscode "saposs.app-studio-remote-access"
vscode "saposs.app-studio-toolkit"
vscode "saposs.sap-guided-answers-extension"
vscode "saposs.vscode-ui5-language-assistant"
vscode "saposs.xml-toolkit"
vscode "sapse.sap-ux-annotation-modeler-extension"
vscode "sapse.sap-ux-application-modeler-extension"
vscode "sapse.sap-ux-fiori-tools-extension-pack"
vscode "sapse.sap-ux-help-extension"
vscode "sapse.sap-ux-service-modeler-extension"
vscode "sapse.vscode-cds"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
